#----------------------------------------------
# -*- encoding=utf-8 -*-                      #
# __author__:'焉知非鱼'                        #
# CreateTime:                                 #
#       2020/10/11 8:06 上午                    #
#                                             #
#               天下风云出我辈，                 #
#               一入江湖岁月催。                 #
#               皇图霸业谈笑中，                 #
#               不胜人生一场醉。                 #
#----------------------------------------------
print('11111111111')
print('add master')
